def withdraw_money(amount):
    """
    Программа принимает сумму, кратную 100, и рассчитывает минимальное
    количество купюр для выдачи, начиная с самых крупных номиналов:
    5000, 2000, 1000, 500, 200, 100. Результат выводится в консоль.

    Параметры:
    amount - сумма для снятия, кратная 100

    Цикл перебирает номиналы, рассчитывает и выводит количество купюр. Ничего не возвращает.

    """

    banknotes = [5000, 2000, 1000, 500, 200, 100]

    print(f"Запрошенная сумма: {amount} руб.")

    
    for bill in banknotes:
        if amount >= bill:
            count = amount // bill
            amount = amount % bill
            print(f"Купюры номиналом {bill}: {count} шт.")
                

amount = int(input("Введите сумму для снятия (кратную 100): "))

withdraw_money(amount)